Repository: fgmacedo/python-statemachine
Catalog: statemachine/locale/*/LC_MESSAGES/statemachine.po
Languages: hi_in, pt_br, zh_cn

source: Did not found name '{}' from model or statemachine
hi_in: मॉडल या स्टेटमशीन में नाम '{}' नहीं मिला
pt_br: Nome '{}' não encontrado no modelo ou na máquina de estados
zh_cn: 在模型或状态机中未找到名称 '{}'

source: Failed to parse boolean expression '{}'
hi_in: बूलियन अभिव्यक्ति '{}' को पार्स करने में विफल रहा
pt_br: Falha ao interpretar a expressão booleana '{}'
zh_cn: 无法解析布尔表达式 '{}'

source: Cannot add callback '{}' to an event with no transitions.
hi_in: बिना ट्रांज़िशन वाले इवेंट में कॉलबैक '{}' नहीं जोड़ सकते।
pt_br: Não é possível adicionar callback '{}' a um evento sem transições.
zh_cn: 无法将回调 '{}' 添加到没有转换的事件。

source: Event {} cannot be called without a SM instance
hi_in: इवेंट {} को SM इंस्टेंस के बिना कॉल नहीं किया जा सकता
pt_br: O evento {} não pode ser chamado sem uma instância de SM
zh_cn: 事件 {} 不能在没有 SM 实例的情况下调用

source: {!r} is not a valid state value.
hi_in: {!r} एक मान्य स्टेट मान नहीं है।
pt_br: {!r} não é um valor de estado válido.
zh_cn: {!r} 不是有效的状态值。

source: Can't {} when in {}.
hi_in: {} स्थिति में {} नहीं कर सकते।
pt_br: Não é possível {} quando em {}.
zh_cn: 在 {} 时无法 {}。

source: There are no states.
hi_in: कोई स्टेट नहीं है।
pt_br: Não há estados.
zh_cn: 没有状态。

source: There are no events.
hi_in: कोई इवेंट नहीं है।
pt_br: Não há eventos.
zh_cn: 没有事件。

source: There should be one and only one initial state. You currently have these: {!r}
hi_in: एक और केवल एक प्रारंभिक स्टेट होना चाहिए। वर्तमान में आपके पास ये हैं: {!r}
pt_br: Deve haver um e apenas um estado inicial. Atualmente, você possui estes: {!r}
zh_cn: 应有且仅有一个初始状态。当前您有这些：{!r}

source: Cannot declare transitions from final state. Invalid state(s): {}
hi_in: अंतिम स्टेट से ट्रांज़िशन घोषित नहीं कर सकते। अमान्य स्टेट: {}
pt_br: Não é possível declarar transições a partir de um estado final. Estado(s) inválido(s): {}
zh_cn: 无法从终止状态声明转换。无效状态：{}

source: All non-final states should have at least one outgoing transition. These states have no outgoing transition: {!r}
hi_in: सभी गैर-अंतिम स्टेट में कम से कम एक आउटगोइंग ट्रांज़िशन होना चाहिए। इन स्टेट में कोई आउटगोइंग ट्रांज़िशन नहीं है: {!r}
pt_br: Todos os estados não finais devem ter pelo menos uma transição de saída. Estes estados não possuem transição de saída: {!r}
zh_cn: 所有非终止状态都应至少有一个外部转换。这些状态没有外部转换：{!r}

source: All non-final states should have at least one path to a final state. These states have no path to a final state: {!r}
hi_in: सभी गैर-अंतिम स्टेट में अंतिम स्टेट तक कम से कम एक पथ होना चाहिए। इन स्टेट में अंतिम स्टेट तक कोई पथ नहीं है: {!r}
pt_br: Todos os estados não finais devem ter pelo menos um caminho para um estado final. Estes estados não possuem caminho para um estado final: {!r}
zh_cn: 所有非终止状态应至少有一个到终止状态的路径。这些状态没有到终止状态的路径：{!r}

source: There are unreachable states. The statemachine graph should have a single component. Disconnected states: {}
hi_in: कुछ स्टेट पहुंच योग्य नहीं हैं। स्टेटमशीन ग्राफ में एक ही घटक होना चाहिए। डिस्कनेक्टेड स्टेट: {}
pt_br: Há estados inacessíveis. O grafo da máquina de estados deve ter um único componente. Estados desconectados: {}
zh_cn: 存在不可到达的状态。状态机图应具有单个组件。断开的状态：{}

source: An event in the '{}' has no id.
hi_in: '{}' में एक इवेंट का आईडी नहीं है।
pt_br: Um evento em '{}' não possui id.
zh_cn: '{}' 中的事件没有 ID。

source: {!r} is not a valid state machine name.
hi_in: {!r} एक मान्य स्टेटमशीन नाम नहीं है।
pt_br: {!r} não é um nome de máquina de estados válido.
zh_cn: {!r} 不是有效的状态机名称。

source: State overriding is not allowed. Trying to add '{}' to {}
hi_in: स्टेट ओवरराइड करना अनुमति नहीं है। '{}' को {} में जोड़ने की कोशिश कर रहे हैं
pt_br: Sobrescrever estados não é permitido. Tentando adicionar '{}' a {}
zh_cn: 不允许覆盖状态。尝试将 '{}' 添加到 {}

source: There are no states or transitions.
hi_in: कोई स्टेट या ट्रांज़िशन नहीं हैं।
pt_br: Não há estados ou transições.
zh_cn: 没有状态或转换。

source: There's no current state set. In async code, did you activate the initial state? (e.g., `await sm.activate_initial_state()`)
hi_in: कोई वर्तमान स्टेट सेट नहीं है। असिंक्रोनस कोड में, क्या आपने प्रारंभिक स्टेट को सक्रिय किया? (उदाहरण: `await sm.activate_initial_state()`)
pt_br: Nenhum estado atual definido. Em código assíncrono, você ativou o estado inicial? (ex.: `await sm.activate_initial_state()`)
zh_cn: 没有设置当前状态。在异步代码中，您是否激活了初始状态？（例如，`await sm.activate_initial_state()`）

source: {} only supports the decorator syntax to register callbacks.
hi_in: {} केवल कॉलबैक रजिस्टर करने के लिए डेकोरेटर सिंटैक्स का समर्थन करता है।
pt_br: {} suporta apenas a sintaxe de decorator para registrar callbacks.
zh_cn: {} 仅支持使用装饰器语法注册回调。

source: Only RTC is supported on async engine
hi_in: असिंक्रोनस इंजन पर केवल RTC समर्थित है
pt_br: Apenas RTC é suportado no motor assíncrono
zh_cn: 异步引擎仅支持 RTC
